import React from 'react';

const User = () => {
    return (
        <div className="aboutMission__texts">
            <h3 className="aboutMission__texts_title">Фрилансер</h3>
            <p className="aboutMission__texts_description">Фрилансер - в задачи фрилансера входит выполнения разовых
                задач, но наш сайт этим не ограничился, мы первая онлайн платформа в Казахстане, которая предлагает Вам
                заключить трудовой договор с работодателями своего города в работе оффлайн формата и у Вас нет
                ограничений найти работу так же онлайн формата.
               <p>
                   От Вас требуется положительная статистика по сайту и быстрое выполнения задач для увеличения
                   привлекательности Вашей анкеты.
               </p>
            </p>
        </div>
    );
};

export default User;