import React from 'react';

const User = () => {
    return (
        <div className="aboutMission__texts">
            <h3 className="aboutMission__texts_title">Работадатель</h3>
            <p className="aboutMission__texts_description">
                Работодатель- в задачи работодателя выходит выставления вакансий и просмотр анкет фрилансеров и тех, кто
                откликнулся на вакансию.
                <p>
                    Мы первая компания в Казахстане, которая дает Вам протестировать навыки фрилансера на других кейсах
                    при
                    этом Вы будете видеть его статистику выполнения задач, а также сможете протестировать его навыки
                    заказав
                    несколько работ. В TASKER Вы сможете найти человека, который сделает Вашу задачу быстро и
                    качественно,
                    при этом Вы, делегируя задачи будете не только экономить время и силы, но и найдете того самого
                    сотрудника, который Вам требуется.
                </p>
            </p>
        </div>
    );
};

export default User;