export const radioData1 = [
    {
        title: 'Время',
        data: ['Менее часа', 'От 1 часа - 3 часов', 'От 4 часов - 10 часов', 'От 10-24 часов', 'До 1 дня', 'До 2 дней', 'До 5 дней', 'До 10 дней']
    }, {
        title: 'Задания',
        data: ['Оффлайн', 'Онлайн']
    }
]

export const radioData2 = [
    {
        title: 'Договор',
        data: ['Трудовой договор', 'Публичный договор и внешнеэкономический', 'Безвзмездный договор', 'Возмездный договор']
    }, {
        title: 'Тип работы',
        data: ['Оффлайн', 'Онлайн']
    }
]